pandas dataframes

In [65]:
import pandas as pd

In [66]:
lst=[[2,3,4,5,6,78,9],[9,0,4,3,5,7,9,2]]
df=pd.DataFrame(lst)
print(df)
print(type(lst))

   0  1  2  3  4   5  6    7
0  2  3  4  5  6  78  9  NaN
1  9  0  4  3  5   7  9  2.0
<class 'list'>

using dictionary AND SERIES

In [67]:
b={'rollno.' :pd.Series([1,2,3,4,5,6]),
   'maths':pd.Series([2,3,4,5,6,7]),
   'phy':pd.Series([3,4,5,6,7,8])}
bf = pd.DataFrame(b)
bf

   rollno.  maths  phy
0        1      2    3
1        2      3    4
2        3      4    5
3        4      5    6
4        5      6    7
5        6      7    8

reading data suing csv(common separated values)

In [68]:
df = pd.read_csv("C:\\Users\\RAJA\\Downloads\\Salary_Data.csv")
df

    YearsExperience    Salary
0               1.1   39343.0
1               1.3   46205.0
2               1.5   37731.0
3               2.0   43525.0
4               2.2   39891.0
5               2.9   56642.0
6               3.0   60150.0
7               3.2   54445.0
8               3.2   64445.0
9               3.7   57189.0
10              3.9   63218.0
11              4.0   55794.0
12              4.0   56957.0
13              4.1   57081.0
14              4.5   61111.0
15              4.9   67938.0
16              5.1   66029.0
17              5.3   83088.0
18              5.9   81363.0
19              6.0   93940.0
20              6.8   91738.0
21              7.1   98273.0
22              7.9  101302.0
23              8.2  113812.0
24              8.7  109431.0
25              9.0  105582.0
26              9.5  116969.0
27              9.6  112635.0
28             10.3  122391.0
29             10.5  121872.0

In [69]:
type(df)

pandas.core.frame.DataFrame

In [70]:
df.columns

Index(['YearsExperience', 'Salary'], dtype='object')

In [71]:
df.shape

(30, 2)

In [72]:
df.size

60

In [73]:
df.head() #gives 1ts 5 rows

   YearsExperience   Salary
0              1.1  39343.0
1              1.3  46205.0
2              1.5  37731.0
3              2.0  43525.0
4              2.2  39891.0

In [74]:
df.head(2)

   YearsExperience   Salary
0              1.1  39343.0
1              1.3  46205.0

In [75]:
df.tail(6) #gives last rows

    YearsExperience    Salary
24              8.7  109431.0
25              9.0  105582.0
26              9.5  116969.0
27              9.6  112635.0
28             10.3  122391.0
29             10.5  121872.0

In [76]:
df.describe()

       YearsExperience         Salary
count        30.000000      30.000000
mean          5.313333   76003.000000
std           2.837888   27414.429785
min           1.100000   37731.000000
25%           3.200000   56720.750000
50%           4.700000   65237.000000
75%           7.700000  100544.750000
max          10.500000  122391.000000

In [77]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 2 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   YearsExperience  30 non-null     float64
 1   Salary           30 non-null     float64
dtypes: float64(2)
memory usage: 612.0 bytes